# Задача 3. Модуль для нахождения уникальных для обоих списков
# элементов
# Создайте модуль с функцией, которая принимает два списка и возвращает
# список, содержащий только элементы, которые уникальны для обоих списков.

import unique_to_both_lists

print(unique_to_both_lists.unique_to_both_lists([1, 2, 3], [3, 4, 5]))