# Создайте несколько переменных разых типов.
# Проверьте к какому типу относяться созданные переменные.

a = 10
b = 10.5
c = 'text'
d = [a, b, c]
e = {'text': a}
print(f'объект {a} имеет тип {type(a)}')
print(f'объект {b} имеет тип {type(b)}')
print(f'объект {c} имеет тип {type(c)}')
print(f'объект {d} имеет тип {type(d)}')
print(f'объект {e} имеет тип {type(e)}')
